#include <stdio.h>
#include <stdlib.h>
/************************************************
函数名:bye
函数功能:清屏并输出结束界面：
          bye
		  ^*^ 
返回值:无（void） 
参数:  无（void） 
作者:宇宙第一聪明第一帅的dnzyx^*^
其他: 
****************************************************/
void bye(void) 
{
    system("cls");
	printf("   **        **    **       ** * * *                   \n");
	printf("   **        **    **      *         *          ***    \n");
	printf("   **        **    **      *          *       **   **\n");
	printf("   **        **    **      * * * * * *       **     **        ** \n");
	printf("   ** ***      * * **      *                **        **     ** \n");
	printf("   **     *        **      *               **           **  ** \n");
	printf("   **    *    *    **       *        *                   ***\n");
	printf("   ** ***     *  * *          * * *                    \n");
	printf("\n\n\n");
	printf("       *                 **                *\n");                                   
	printf("      *  *             *****              *  *\n");
	printf("     *     *         **********          *    *\n");
	printf("    *       *          ******           *      *\n");
    printf("   *          *          **            *        *\n");
}
