#include <stdio.h>
#include <stdlib.h>
/***************************************
函数名: selectdifficult_menu
函数功能:清屏并输出选择关卡菜单 
返回值:无（void） 
参数:  无（void） 
作者:宇宙第一聪明第一帅的dnzyx^*^
其他:  无 
******************************************/ 
void selectlevel_menu(void)
 {
     system("cls");
     printf("请选择关卡：\n\n") ;
     printf("              >>>1  新手入门<<<       >>>2  牛刀小试<<<\n\n");
     printf("              >>>3  飘向天空<<<       >>>4  地心引力<<< \n\n");
     printf("              >>>5  向左看齐<<<       >>>6  向右前进<<<\n\n");
     printf("              >>>7  一起摇摆<<<       >>>8  上下起伏<<< \n\n");
     printf("              >>>9  漂浮不定<<<       >>>10 进入地狱<<<\n\n");
     printf("                            >>>11 返回<<<\n\n");
     printf(" (小提示:亲,如果觉得太难,输入'0 0'洗牌或输入'0 1'启动炸弹哦^*^)\n"); 
 } 
